snlkuharlocal/src/Documents/ПланПродажПоКлиентам/ПланПродажПоКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПродажПоКлиентам</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ПланПродажПоКлиентам</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИзмененияКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Полугодие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПродаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПродаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланПродаж</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.ТипыТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Бренд</name>
      <type>
        <types>CatalogRef.БрендыДляПлана</types>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактГод_1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактГод_2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПродаж</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МесяцевПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МесяцевПродажФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУдорожания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Округ</name>
      <type>
        <types>CatalogRef.Округа</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Бренд</name>
      <type>
        <types>CatalogRef.БрендыДляПлана</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.ТипыТовара</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/КоэффициентыСезонности/КоэффициентыСезонности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоэффициентыСезонности</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Округ</name>
    <type>
      <types>CatalogRef.Округа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.БрендыДляПлана</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.ТипыТовара</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ПланПродажПоКлиентам/ПланПродажПоКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланПродажПоКлиентам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.ТипыТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.БрендыДляПлана</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>КолРасх</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолПрих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СумРасх</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СумПрих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Профит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПродажиБезВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЧерезКассу</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/КоэффициентыУдорожания/КоэффициентыУдорожания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоэффициентыУдорожания</name>
  <informationRegisterPeriodicity>Quarter</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.БрендыДляПлана</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.ТипыТовара</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ПланПродажПоКлиентам/ObjectModule.bsl
Функция ПолучитьДатыПланирования() Экспорт
	Если Полугодие=1 Тогда
		Дата1	= НачалоГода(Дата);
		Дата2	= КонецМесяца(ДобавитьМесяц(Дата1,5));	
	Иначе
		Дата1	= ДобавитьМесяц(НачалоГода(Дата),6);
		Дата2	= КонецГода(Дата1);	
	КонецЕсли;
	
	Дата11	= ДобавитьМесяц(Дата1,-12);
	Дата12	= ДобавитьМесяц(Дата2,-12);	
		
	Дата21	= ДобавитьМесяц(Дата1,-24);
	Дата22	= ДобавитьМесяц(Дата2,-24);
	
	// Кухарь А.Ю.  25.01.2024 начало
	//
	если ЗначениеЗаполнено(ДатаНачалаПродаж) и ЗначениеЗаполнено(ДатаОкончанияПродаж) тогда
		Дата21	= '19900101';
		Дата22	= '19900201';	
		Дата11	= ДатаНачалаПродаж;
		Дата12	= КонецДня(ДатаОкончанияПродаж);	
	КонецЕсли;
	// Кухарь А.Ю.  25.01.2024 конец
	
	
	Возврат Новый Структура("Дата1,Дата2,Дата11,Дата12,Дата21,Дата22",Дата1,Дата2,Дата11,Дата12,Дата21,Дата22);
КонецФункции //ПолучитьДатыПланирования()

Процедура РаспределитьПоБазе(СтрокиБазы,Знач Суммы,КолонкаБазы="БазаРаспределения",Фильтр=Неопределено,ИмяРаспределения="") Экспорт	
	Если Фильтр<>Неопределено Тогда
		ТекСтрокиБазы=СтрокиБазы.НайтиСтроки(Фильтр);	
	Иначе
		ТекСтрокиБазы=СтрокиБазы;		
	КонецЕсли; 
	
	База=0;
	Для Каждого СтрокаБазы Из ТекСтрокиБазы Цикл
		База=База+СтрокаБазы[КолонкаБазы];	
	КонецЦикла;	
	
	Если База=0 Тогда
		Сообщить("Нулевая база распределения ! "+ИмяРаспределения,СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;	
	
	Распределено=Новый Соответствие;
	Для Каждого Элемент Из Суммы Цикл
		Распределено.Вставить(Элемент.Ключ,0);			
	КонецЦикла; 
	
	МаксСтрока=Неопределено;МаксСумма=-1000000000000000000000000000000;
	Для Каждого СтрокаБазы Из ТекСтрокиБазы Цикл
		Для Каждого Элемент Из Суммы Цикл			
			СтрокаБазы[Элемент.Ключ]=Элемент.Значение*СтрокаБазы[КолонкаБазы]/База;					
			Распределено.Вставить(Элемент.Ключ,Распределено.Получить(Элемент.Ключ)+СтрокаБазы[Элемент.Ключ]);
		КонецЦикла;
		
		Если СтрокаБазы[КолонкаБазы]>МаксСумма Тогда
			МаксСумма	=СтрокаБазы[КолонкаБазы];
			МаксСтрока	=СтрокаБазы;
		КонецЕсли; 
	КонецЦикла;	
	
	Если МаксСтрока<>Неопределено Тогда
		Для Каждого Элемент Из Суммы Цикл
			Дельта=Элемент.Значение-Распределено.Получить(Элемент.Ключ);
			МаксСтрока[Элемент.Ключ]=МаксСтрока[Элемент.Ключ]+Дельта;
			//Если ПараметрыСеанса.Отладка Тогда
			//	Сообщить("Дельта по распределению "+ИмяРаспределения+" "+Элемент.Ключ+" "+Дельта);		
			//КонецЕсли;		
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)			
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=Ложь;
		
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;		

	Если Отказ Тогда Возврат КонецЕсли;
		
	Если ЕстьИзменения Тогда		
		СуммаДокумента		= ПланПродаж.Итог("Всего");
		//ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект,"Состав",?(Детальный,"Номенклатура","Модель"));
		
		ПланПродаж.Сортировать("Контрагент,Бренд,ТипТовара");	
	Иначе
		Если (НЕ Ссылка.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение) ИЛИ Ссылка.ПометкаУдаления<>ПометкаУдаления Тогда
			НужноВыгружать=Истина;			
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры

Процедура РаспределитьПоМесяцам(Элемент=Неопределено)
	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ДатыПланирования=ПолучитьДатыПланирования();
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ Бренд,ТипТовара ПОМЕСТИТЬ Товары ИЗ &Товары КАК Товары
	|;	
	|ВЫБРАТЬ 
	|	Бренд,ТипТовара,
	|	Период КАК Период,
	|	Округ,
	|	Коэффициент
	|ИЗ
	|	РегистрСведений.КоэффициентыСезонности
	|ГДЕ
	|	Период МЕЖДУ &Дата1 И &Дата2
	|	И (Бренд,ТипТовара) В (ВЫБРАТЬ РАЗЛИЧНЫЕ Бренд,ТипТовара ИЗ Товары)	
	|";
	
	ДатыПланирования=ПолучитьДатыПланирования();	
	
	Запрос.УстановитьПараметр("Дата1",	ДатыПланирования.Дата1);
	Запрос.УстановитьПараметр("Дата2",	ДатыПланирования.Дата2);
	
	Запрос.УстановитьПараметр("Товары",	Товары);
	
	Результат	= Запрос.Выполнить();
	
	ТБ=ПланПродаж.Выгрузить(,"Бренд,ТипТовара,Округ");
	ТБ.Свернуть("Бренд,ТипТовара,Округ");
	
	ТР=Запрос.Выполнить().Выгрузить();
	ТР.Колонки.Добавить("Сумма",ПолучитьОписаниеТиповЧисла(12,0));
	
	ТР.Индексы.Добавить("Бренд,ТипТовара,Округ");
	
	ДвиженияПоРег=Движения.ПланПродажПоКлиентам;
	ДвиженияПоРег.Очистить();
	
	Для Каждого СтрокаТБ Из ТБ Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		Фильтр=Новый Структура("Бренд,ТипТовара,Округ");	
		ЗаполнитьЗначенияСвойств(Фильтр,СтрокаТБ);
		
		СтрокиПлана=ПланПродаж.НайтиСтроки(Фильтр);
		Для Каждого СтрокаПлана Из СтрокиПлана Цикл
			ТР.ЗаполнитьЗначения(0,"Сумма");
			РаспределитьПоБазе(ТР,Новый Структура("Сумма",СтрокаПлана.Всего),"Коэффициент",Фильтр,""+СтрокаПлана.Контрагент);
			Для Каждого СтрокаТР Из ТР Цикл
				Если СтрокаТР.Сумма<>0 Тогда
					Движение		= ДвиженияПоРег.Добавить();
					
					ЗаполнитьЗначенияСвойств(Движение,СтрокаТР);					
					
					Движение.Подразделение	= Подразделение;
					Движение.Контрагент		= СтрокаПлана.Контрагент;
				КонецЕсли;				
			КонецЦикла; 
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Валюта 	= Основание.Валюта;
		ИБ 		= Основание.ИБ;
		Склад 	= Основание.Склад;
		ТипЦен 	= Основание.ТипЦен;
		
		Для Каждого СтрокаИст Из Основание.Товары  Цикл
			Если СтрокаИст.Количество=0 Тогда Продолжить КонецЕсли;
			
			СтрокаТЧ=ПланПродаж.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаИст);
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыСтроки(СтрокаПП) Экспорт
	Контрагент				= СтрокаПП.Контрагент;
	
	Реквизиты	= Новый Структура("Округ,КоличествоТМ,Менеджер",Контрагент.Регион.Округ,Контрагент.КоличествоТорговыхМарок,Контрагент.Менеджер);
	ЗаполнитьЗначенияСвойств(СтрокаПП,Реквизиты);
КонецПроцедуры

Процедура ЗаполнитьПродажиКлиентов() Экспорт
	ДатыПланирования= ПолучитьДатыПланирования();
	Запрос			= СоздатьЗапросПоПродажам(ДатыПланирования,ПланПродаж.ВыгрузитьКолонку("Контрагент"));	
	
	ВыборкаПоПокупателям=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Контрагент");
	Пока ВыборкаПоПокупателям.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();		
		#КОНЕЦЕСЛИ 
		
		ВыборкаПоБрендам	= ВыборкаПоПокупателям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Бренд");	
		Пока ВыборкаПоБрендам.Следующий() Цикл
			ВыборкаПоТипуТовара=ВыборкаПоБрендам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ТипТовара");
			Пока ВыборкаПоТипуТовара.Следующий() Цикл				
				СтруктураПоиска=Новый Структура("Контрагент,Бренд,ТипТовара");				
				ЗаполнитьЗначенияСвойств(СтруктураПоиска,ВыборкаПоТипуТовара);
				СтрокиТЧ=ПланПродаж.НайтиСтроки(СтруктураПоиска);
				Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
					СтрокаТЧ.КоэффициентУдорожания	= ВыборкаПоТипуТовара.КоэффициентУдорожания;				
					СтрокаТЧ.Всего					= ВыборкаПоТипуТовара.Оборот;														
					
					ВыборкаПоПГ=ВыборкаПоТипуТовара.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Год");						
					Пока ВыборкаПоПГ.Следующий() Цикл
						Если ВыборкаПоПГ.Год=1 Тогда
							СтрокаТЧ.ФактГод_1=ВыборкаПоПГ.Оборот;
						ИначеЕсли ВыборкаПоПГ.Год=2 Тогда
							СтрокаТЧ.ФактГод_2=ВыборкаПоПГ.Оборот;				
						КонецЕсли;
					КонецЦикла;
					
					СтрокаТЧ.КоличествоТМ	= ВыборкаПоПокупателям.КоличествоТМ;
					СтрокаТЧ.НачалоПродаж	= ВыборкаПоПокупателям.НачалоПродаж;
				
					СтрокаТЧ.Коэффициент		= 100+2.5*СтрокаТЧ.КоличествоТМ;
				
					Если СтрокаТЧ.НачалоПродаж>ДатыПланирования.Дата11 Тогда
						СтрокаТЧ.МесяцевПродаж=Месяц(ДатыПланирования.Дата12)-Месяц(СтрокаТЧ.НачалоПродаж)+1;
					ИначеЕсли СтрокаТЧ.НачалоПродаж>ДатыПланирования.Дата21 Тогда		
						СтрокаТЧ.МесяцевПродаж=Месяц(ДатыПланирования.Дата22)-Месяц(СтрокаТЧ.НачалоПродаж)+1+6;
					Иначе
						СтрокаТЧ.МесяцевПродаж=12;					
					КонецЕсли; 
				КонецЦикла;				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция СоздатьЗапросПоПродажам(ДатыПланирования,СписокКонтрагентов=Неопределено) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ Бренд,ТипТовара ПОМЕСТИТЬ Товары ИЗ &Товары КАК Товары
	|;
	|ВЫБРАТЬ Подразделение ПОМЕСТИТЬ Подразделения ИЗ &Подразделения КАК Подразделения
	|;	
	|ВЫБРАТЬ	
	|	Сводный.Год,
	|	Сводный.Бренд,
	|	Сводный.ТипТовара,	
	|	Сводный.Контрагент,		
	|	Сводный.Контрагент.Регион.Округ КАК Округ,		
	|
	|	МАКСИМУМ(IsNULL(КоэффУД.Коэффициент,100))	КАК КоэффициентУдорожания,
	|	МАКСИМУМ(КоличествоТМ)						КАК КоличествоТМ,
	|	МИНИМУМ(Сводный.ПериодМесяц)				КАК НачалоПродаж,		
	|	СУММА(Оборот)								КАК Оборот	
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	1 КАК Год,
	|	ПериодМесяц,		
	|	Номенклатура.Родитель.БрендДляПлана			КАК Бренд,
	|	Номенклатура.Родитель.ТипНоменклатуры	 	КАК ТипТовара,
	|	Подразделение,
	|	Покупатель.Ведущий 							КАК Контрагент,		
	|	Покупатель.Ведущий.КоличествоТорговыхМарок 	КАК КоличествоТМ,
	|	
	|	ПериодМесяц									КАК НачалоПродаж,		
	|	ОборотОборот 								КАК Оборот		
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&Дата11,&Дата12,Авто,
	|		Подразделение В (ВЫБРАТЬ РАЗЛИЧНЫЕ Подразделение ИЗ Подразделения)
	|		И (Номенклатура.Родитель.БрендДляПлана,Номенклатура.Родитель.ТипНоменклатуры) В (ВЫБРАТЬ РАЗЛИЧНЫЕ Бренд,ТипТовара ИЗ Товары)
	|	"+	?(ЗначениеЗаполнено(СписокКонтрагентов),"И Покупатель.Ведущий В (&СписокКонтрагентов)","")+"
	|	) КАК ПродажиОбороты
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	2 КАК Год,
	|	ПериодМесяц,		
	|	Номенклатура.Родитель.БрендДляПлана			КАК Бренд,
	|	Номенклатура.Родитель.ТипНоменклатуры	 	КАК ТипТовара,
	|	Подразделение,
	|	Покупатель.Ведущий 							КАК Контрагент,		
	|	Покупатель.Ведущий.КоличествоТорговыхМарок 	КАК КоличествоТМ,
	|	
	|	ПериодМесяц									КАК НачалоПродаж,		
	|	ОборотОборот 								КАК Оборот		
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&Дата21,&Дата22,Авто,
	|		Подразделение В (ВЫБРАТЬ РАЗЛИЧНЫЕ Подразделение ИЗ Подразделения)
	|		И (Номенклатура.Родитель.БрендДляПлана,Номенклатура.Родитель.ТипНоменклатуры) В (ВЫБРАТЬ РАЗЛИЧНЫЕ Бренд,ТипТовара ИЗ Товары)
	|	"+	?(ЗначениеЗаполнено(СписокКонтрагентов),"И Покупатель.Ведущий В (&СписокКонтрагентов)","")+"
	|	) КАК ПродажиОбороты
	|) КАК Сводный
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КоэффициентыУдорожания КАК КоэффУД
	|ПО
	|	Сводный.Бренд		= КоэффУД.Бренд
	|	И Сводный.ТипТовара	= КоэффУД.ТипТовара		
	|	И КоэффУД.Период	= НАЧАЛОПЕРИОДА(&Дата1,Год)
	|СГРУППИРОВАТЬ ПО
	|	Сводный.Год,	
	|	Сводный.Контрагент,
	|	Сводный.Бренд,
	|	Сводный.ТипТовара
	|АВТОУПОРЯДОЧИВАНИЕ
	|ИТОГИ 
	|	СУММА(Оборот),
	|	МИНИМУМ(НачалоПродаж),
	|	МАКСИМУМ(КоличествоТМ),
	|	МАКСИМУМ(КоэффициентУдорожания), 
	|	МАКСИМУМ(Округ)
	|ПО 
	|	Сводный.Контрагент,Сводный.Бренд,Сводный.ТипТовара,Сводный.Год
	|";	
	
	
	Запрос.УстановитьПараметр("Подразделения",	Подразделения);
	Запрос.УстановитьПараметр("Товары",			Товары);
	Если ЗначениеЗаполнено(СписокКонтрагентов) Тогда
		Запрос.УстановитьПараметр("СписокКонтрагентов",	СписокКонтрагентов);	
	КонецЕсли; 
	
	
	Для Каждого Элемент Из ДатыПланирования Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ,Элемент.Значение);	
	КонецЦикла;
	
	Возврат Запрос;
КонецФункции //СоздатьЗапросПоПродажам()

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
